In [13]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [14]:
df = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)
df

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [20]:
df.groupby("class").describe(include=[np.object, pd.Categorical])

       order
       count unique            top freq
class
bird       2      2  Falconiformes    1
mammal     3      2      Carnivora    2

In [ ]:
df.groupby('clas')

In [16]:
df.groupby(["class", "order"])['max_speed'].sum()

class   order
bird    Falconiformes     389.0
        Psittaciformes     24.0
mammal  Carnivora         138.2
        Primates            0.0
Name: max_speed, dtype: float64

In [17]:
df.groupby(["class", "order"]).describe()

                      max_speed                                          \
                          count   mean        std    min     25%    50%
class  order
bird   Falconiformes        1.0  389.0        NaN  389.0  389.00  389.0
       Psittaciformes       1.0   24.0        NaN   24.0   24.00   24.0
mammal Carnivora            2.0   69.1  15.697771   58.0   63.55   69.1
       Primates             0.0    NaN        NaN    NaN     NaN    NaN


                          75%    max
class  order
bird   Falconiformes   389.00  389.0
       Psittaciformes   24.00   24.0
mammal Carnivora        74.65   80.2
       Primates           NaN    NaN

In [18]:
def get_letter_type(letter):
    if letter[0].lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'

df.groupby(get_letter_type, axis=1).groups

{'consonant': ['class', 'max_speed'], 'vowel': ['order']}

In [19]:
df.groupby(get_letter_type, axis=1).last()

        consonant           vowel
falcon      389.0   Falconiformes
parrot       24.0  Psittaciformes
lion         80.2       Carnivora
monkey     mammal        Primates
leopard      58.0       Carnivora